Revit 2026 API

# MultiReferenceAnnotationOptionsSetAdditionalReferencesToDimension Method

---
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public void SetAdditionalReferencesToDimension(
	IList<Reference> referencesToDimension
)
```
```vb
Public Sub SetAdditionalReferencesToDimension (
	referencesToDimension As IList(Of Reference)
)
```
```cpp
public:
void SetAdditionalReferencesToDimension(
	IList<Reference^>^ referencesToDimension
)
```
```fsharp
member SetAdditionalReferencesToDimension :
        referencesToDimension : IList<Reference> -> unit
```

#### Parameters

referencesToDimension IListReference

#### Reference

MultiReferenceAnnotationOptions Class

Autodesk.Revit.DB Namespace